In [1]:
import pandas as pd
import numpy as np

In [2]:
#딕셔너리와 리스트 자료구조를 이용해 데이터 저장
data={'MONTH':['JAN','FEB','MAR','APR','MAY'],
      'TOTAL EXPENSES':[736434,1195378,899053,1005948,1192204],
      'FASHION':[149000,94000,0,75000,395100]}

In [5]:
#df라는 이름으로 Pandas의 DataFrame 작성
df=pd.DataFrame(data)
df

  MONTH  TOTAL EXPENSES  FASHION
0   JAN          736434   149000
1   FEB         1195378    94000
2   MAR          899053        0
3   APR         1005948    75000
4   MAY         1192204   395100

In [8]:
#작성한 DataFrame의 열과 행에 대한 정보를 확인
df.shape

(5, 3)

In [9]:
#Feature 리스트 확인
df.columns

Index(['MONTH', 'TOTAL EXPENSES', 'FASHION'], dtype='object')

In [10]:
#Sample 정보 확인
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
#각 열과 행에 해당되는 데이터 출력
df.values

array([['JAN', 736434, 149000],
       ['FEB', 1195378, 94000],
       ['MAR', 899053, 0],
       ['APR', 1005948, 75000],
       ['MAY', 1192204, 395100]], dtype=object)

In [16]:
#특정 feature에 대한 데이터 확인
df['TOTAL EXPENSES']

0     736434
1    1195378
2     899053
3    1005948
4    1192204
Name: TOTAL EXPENSES, dtype: int64

In [17]:
#특정 feature에 대한 데이터 변경
df['FASHION']=0

In [19]:
df

  MONTH  TOTAL EXPENSES  FASHION
0   JAN          736434        0
1   FEB         1195378        0
2   MAR          899053        0
3   APR         1005948        0
4   MAY         1192204        0

In [20]:
df['FASHION']=[1,2,3,4,5]

In [21]:
df

  MONTH  TOTAL EXPENSES  FASHION
0   JAN          736434        1
1   FEB         1195378        2
2   MAR          899053        3
3   APR         1005948        4
4   MAY         1192204        5

In [38]:
df['etc']=np.arange(5)
df

  MONTH  TOTAL EXPENSES  FASHION  etc
0   JAN          736434        1    0
1   FEB         1195378        2    1
2   MAR          899053        3    2
3   APR         1005948        4    3
4   MAY         1192204        5    4

In [39]:
#인덱싱을 통해 sample의 일부분만 확인 --> 0번째 인덱스부터 시작
df[0:3]

  MONTH  TOTAL EXPENSES  FASHION  etc
0   JAN          736434        1    0
1   FEB         1195378        2    1
2   MAR          899053        3    2

In [41]:
#loc을 이용해 행 또는 열의 데이터 조회
#loc은 중괄호가 아닌 대괄호 사용
#1번재 인덱스에 해당되는 sample의 데이터 조회
df.loc[1]

MONTH                 FEB
TOTAL EXPENSES    1195378
FASHION                 2
etc                     1
Name: 1, dtype: object